
    //Массив хранит 30-ть значений курса доллара по дням за один месяц

    var usd =  [26.4, 24.54, 26.08, 24.06, 25.27, 25.24, 24.61, 26.81, 24.12, 25.8, 25.5, 24.59, 26.67, 26.74, 25.79, 24.28, 26.12, 26.58, 24.27, 24.36, 24.97, 25.51, 25.23, 26.33, 26.7, 24.4, 25.25, 26.98, 25.51, 24.49]; 

    //Дальше можно писать код

    max = (-10)**15 
    date = 0
    for(i=0; i<usd.length; i++){
        if(usd[i]>max){
            max = usd[i]
            date = i
        }
    }
    console.log(`максимум ${max}, дата ${date+1}`)


    rise=0
    fall=0
    for (i=0; i<usd.length; i++){
        if(usd[i]<usd[i+1]){
            rise++
        }
        if(usd[i]>usd[i+1]){
            fall++
        }
    }
    